[
    {
        "id": "19341",
        "sku": "73233",
        "pic": "https://img-c.udemycdn.com/course/750x422/6576515_3af1.jpg",
        "title": "Docker for Web Developers",
        "coupon": "https://www.udemy.com/course/docker-for-website-developers/?couponCode=EARLYMARKHOR",
        "org_price": "$46.99",
        "desc_text": "Are you a web developer who has never used Docker before? Want to simplify your development, testing, and deployment process? This course is for you.\nDocker for Web Developers is a hands-on, practical course designed to help web developers like you learn Docker from scratch—no DevOps experience needed. Whether you work with PHP, Node.js, Python, or any other web stack, this course will show you how to use Docker to build and manage reliable development environments that mirror production.\nThis course is not only about theory, as how Docker works, it includes hands-on demos of each concept discussed in this course so that you can get a good grasp of all the key concepts required to use Docker.\nYou’ll start with the basics of containers and images, then move on to running real-world web applications using Docker and Docker Compose. You’ll learn how to containerize different services, how they work together, and how to connect them seamlessly. By the end, you’ll also know how to deploy your containerized app.\nWhat you’ll get:\nA clear understanding of Docker concepts with real-world examples\nStep-by-step guidance to containerize your own web projects\nDocker Compose for multi-service applications\nTips for debugging and managing containers effectively\nHands-on tips and tricks\nBy the end of this course, you’ll be confident using Docker in your daily workflow—saving time, avoiding conflicts, and building more reliable applications.",
        "category": "IT & Software, Other IT & Software",
        "language": "Danish",
        "platform": "Udemy",
        "rating": 4.5,
        "duration": 3,
        "expiry": "2025-07-07T18:26:16.153Z",
        "savedtime": "2025-07-02T18:26:16.153Z"
    },
    {
        "id": "19342",
        "sku": "16896",
        "pic": "https://img-c.udemycdn.com/course/750x422/2728986_565e_3.jpg",
        "title": "Gmail – Grundkurs für jeden Einsteiger!",
        "coupon": "https://www.udemy.com/course/gmail-grundkurs/?couponCode=8DAC1EDB3D7DD57AE641",
        "org_price": "$84.99",
        "desc_text": "In diesem Kurs lernst Du, Gmail effektiv zu nutzen, so dass auch Du produktiver wirst und eine Ordnung in Dein Postfach bekommst.\nGmail ist mittlerweile eines der meistverwendeten E-Mail Programme der Welt und dennoch wenden die meisten nur grundsätzliche Funktionen an.\nIn diesem Kurs lernst Du alle wichtigen und grundlegenden Funktionen kennen, damit auch Du mit Gmail richtig durchstarten kannst, ohne dabei wichtige Zeit zu verlieren.\nWenn Du heute noch anfängst, Gmail mit samt seinen Funktionen zu nutzen, wirst Du schnell Routine bekommen und Du wirst einen super Überblick in Deinem Postfach erhalten.\nDu musst dafür kein PC-Profi sein, im Gegenteil, ich zeige Dir alle Funktionen Schritt-für-Schritt, so dass Du meinen praktischen Erklärungen + Beispielen im gesamten Kurs folgen kannst.\nSchreib dich jetzt in den Kurs ein und fange noch heute an, Gmail produktiv zu nutzen, um mehrere Stunden in der Woche zu sparen!",
        "category": "Office Productivity",
        "language": "German",
        "platform": "Udemy",
        "rating": 4.35,
        "duration": 3,
        "expiry": "2025-07-07T18:26:16.153Z",
        "savedtime": "2025-07-02T18:26:16.153Z"
    },
    {
        "id": "19343",
        "sku": "33120",
        "pic": "https://img-c.udemycdn.com/course/750x422/5016394_2d53_6.jpg",
        "title": "Python Programming Mastery: From Beginner to Expert",
        "coupon": "https://www.udemy.com/course/python-programming-mastery-from-beginner-to-expert/?couponCode=PYTHON_FREE",
        "org_price": "$19.99",
        "desc_text": "Welcome to the Python Programming Mastery: From Beginner to Expert – The course you need to learn to code with Python\nThe course is Structured to help you kick-start your career as a python developer even if you are a complete beginnner;\nAt 50+ hours, this Python course is without a doubt a very comprehensive and beginner-friendly Python course. Even if you have zero programming experience, this course will take you from beginner to professional.\nWe’ll take you step-by-step through engaging video tutorials and teach you everything you need to know to succeed as a Python developer.\nThe course includes over 50 hours of HD video tutorials and builds your programming knowledge while making real-world Python projects.\nThroughout this comprehensive course, we cover a massive amount of tools and technologies, including:\nPython 3 – the latest version of Python\nPython Scripting\nData Science\nPandas\nNumpy\nMatplotlib\nFlet Framework (Flutter)\nRequest\nRegex (Regular Expression)\nJson\nAPI Integration\nChatGPT API\nGit, GitHub and Version Control\nand much much more!\nBy the end of this course, you will be fluently programming in Python and you’ll be so good at Python that you can get a job or use the language professionally.\nYou’ll also build a projects that you can show off to any potential employer. Including:\nBuild Web, mobile and Desktop Applications using Flet framework\nLearn and Understanding Object Oriented Programming with Python\nAutomate Sending Emails using SMTPlib\nSolve Python CodeWars Challenges and get familiar with Coding interviews\nand much much more!\nSign up today, and look forward to:\nVideo Lectures\nCode Challenges and Exercises\nFully Fledged Projects\nDownloads\n“With consistency, everyone can be a pro”\nJoin me today and learn Python Programming to its fullest with hands on experience.",
        "category": "Development, Web Development",
        "language": "English",
        "platform": "Udemy",
        "rating": 4.852941,
        "duration": 55,
        "expiry": "2025-07-07T18:26:16.153Z",
        "savedtime": "2025-07-02T18:26:16.153Z"
    },
    {
        "id": "19344",
        "sku": "39040",
        "pic": "https://img-c.udemycdn.com/course/750x422/5962816_64c4_2.jpg",
        "title": "Master Next.js for Beginners 2024 with projects",
        "coupon": "https://www.udemy.com/course/master-nextjs-with-projects/?couponCode=D00A2CF20DB86265A456",
        "org_price": "$19.99",
        "desc_text": "Welcome to “Build Scalable Web Apps with Next.js”! This course is designed to take you on a comprehensive journey through the fundamentals and advanced features of Next.js, enabling you to create robust, high-performance web applications.\nIn this course, you will:\nUnderstand the Fundamentals of Next.js: Start with the basics, exploring Next.js core features and understanding why it is an essential tool for modern web development.\nUtilize the OpenAI API: Learn how to integrate the OpenAI API into your applications, adding advanced AI functionalities and enhancing user experiences.\nDeploy Next.js Applications: Gain practical experience in deploying your Next.js applications to various platforms, ensuring they are production-ready.\nIntegrate with APIs and MongoDB Database: Understand how to connect your Next.js applications with various APIs and MongoDB, allowing for dynamic data handling and storage.\nImplement Authentication: Learn how to secure your applications by implementing authentication, ensuring only authorized users can access specific parts of your app.\nMaster Server Actions: Dive into advanced server actions to manage server-side processes effectively and optimize application performance.\nUtilize Routing in Next.js: Master the powerful routing capabilities of Next.js, including dynamic and nested routes, to create seamless user experiences.\nImplement Caching Strategies: Explore various caching strategies to improve the speed and performance of your web applications, ensuring they run efficiently.\nBuild Real-World Projects: Apply the skills and knowledge you have gained to build and deploy real-world projects, providing you with hands-on experience and a strong portfolio.\nBy the end of this course, you will have a deep understanding of Next.js and be equipped with the skills to build, deploy, and scale sophisticated web applications. Whether you are a beginner looking to get started with web development or an experienced developer aiming to enhance your skill set, this course will provide you with valuable insights and practical experience.\nJoin us on this exciting journey and unlock your potential in modern web development with Next.js!",
        "category": "Development, Web Development",
        "language": "English",
        "platform": "Udemy",
        "rating": 3.9,
        "duration": 6,
        "expiry": "2025-07-07T18:26:16.153Z",
        "savedtime": "2025-07-02T18:26:16.153Z"
    },
    {
        "id": "19345",
        "sku": "73232",
        "pic": "https://img-c.udemycdn.com/course/750x422/6691789_eafc_2.jpg",
        "title": "GitHub Copilot for Beginners: AI Coding Crash Course",
        "coupon": "https://www.udemy.com/course/github-copilot-for-beginners-ai-coding-crash-course/?couponCode=02JULY2025",
        "org_price": "$84.99",
        "desc_text": "Learn GitHub Copilot from scratch on practice.\nYou’ll explore how Copilot works, understand its interface, and use its key features step by step. We’ll also walk through Copilot’s pricing plans, privacy settings, and how to make the most of AI coding tools in your daily workflow.\nWho is this course for?\nBeginner developers who want to learn GitHub Copilot and AI tools\nReact or JavaScript learners looking to code faster with AI and try Vibe Coding\nStudents and professionals exploring real-world AI coding workflows\nAnyone curious how GitHub Copilot works in real projects and brings Vibe Coding to life\nWhat’s in this course?\nLearn how to use GitHub Copilot effectively on Practice\nUnderstand GitHub Copilot Payment Plans, Usage Limits and explore Data Privacy\nLearn common Developer Use Cases for Copilot with practical Prompt Examples\nSet up GitHub Copilot in VS Code and connect it to your GitHub account\nExplore key Copilot Features: Code Completions, Chat Interface, Smart Actions, Chat Modes (Ask, Edit, Agent), and Chat Context\nUse Copilot for tasks like UI Improvements, generating Unit Tests, and Code Refactoring etc.\nThis Course includes:\nTheory and Practice: About 2 hours of lectures with many practical examples (3-10 min lessons duration).\nUdemy Certificate: which you will receive after completing the course.\nSupport: If you have any questions, we will always be willing to answer them.\nMeet your instructor!\nDmytro Vasyliev – Senior Front-end Engineer with more than 10 years of professional experience in developing complex Web Applications. I have extensive experience with React and other frameworks, having used it in various projects to build dynamic and efficient user interfaces.\nDo you need to be concerned?\nThis course comes with a 30-day money-back guarantee.\nJoin our course today to learn how to build your first application in React!",
        "category": "IT & Software, Other IT & Software",
        "language": "English",
        "platform": "Udemy",
        "rating": 4.1,
        "duration": 2,
        "expiry": "2025-07-07T18:26:16.153Z",
        "savedtime": "2025-07-02T18:26:16.153Z"
    },
    {
        "id": "19335",
        "sku": "73231",
        "pic": "https://img-c.udemycdn.com/course/750x422/6571299_97ad_3.jpg",
        "title": "Meta AI on WhatsApp: Learn Everyday AI Skills",
        "coupon": "https://www.udemy.com/course/meta-ai-for-beginners-write-learn-create-with-prompts/?couponCode=508637C511A04BC795D4",
        "org_price": "$84.99",
        "desc_text": "What if you could have your own personal assistant — to help you write emails, generate stories, summarize text, translate instantly, or even create beautiful images — right from your phone or laptop? With Meta AI, now you can.\nThis Basic Meta AI course is designed for complete beginners, and shows you step-by-step how to use Meta’s powerful AI assistant for everyday tasks — with zero coding skills required.\nWhether you’re a student looking for study help, a professional wanting faster communication, or someone curious about AI, this course will teach you how to make Meta AI your go-to tool for productivity, creativity, and learning.\nWhat You’ll Learn:\nWrite and respond to emails with proper grammar, tone, and structure\nFix grammar, translate text, summarize, rewrite, and improve your writing\nGenerate images from text prompts — posters, illustrations, ideas, and more\nGet academic help — explanations, study guides, summaries, and more\nPerform sentiment analysis and understand emotional tone in messages\nUse effective prompts to get accurate and creative results\nApply Meta AI in personal, educational, and light professional contexts\nYou’ll be learning through live demonstrations, simple prompts, and real-world examples that you can instantly try on your own phone or computer — even inside WhatsApp.\nWhy This Course Is Different:\n100% beginner-friendly — no setup, no installation, no coding\nDesigned for everyday use — work, study, personal life, and creative projects\nIncludes downloadable prompt examples you can reuse\nFast-paced and focused — no fluff, just practical AI skills\nTaught in clear language, with examples anyone can understand\nBy the end of this course, you’ll be confident using Meta AI to speed up tasks, improve communication, and explore your creativity. You’ll understand how to use AI as a supportive tool — and feel empowered to do more with it every day.\nJoin now to unlock the practical power of Meta AI and transform how you work, learn, and create.",
        "category": "Office Productivity",
        "language": "English",
        "platform": "Udemy",
        "rating": 4.5227275,
        "duration": 2,
        "expiry": "2025-07-07T12:26:15.885Z",
        "savedtime": "2025-07-02T12:26:15.885Z"
    },
    {
        "id": "19336",
        "sku": "9828",
        "pic": "https://img-c.udemycdn.com/course/750x422/338646_7583_3.jpg",
        "title": "Video Production: You Can Make Simple Talking Head Video",
        "coupon": "https://www.udemy.com/course/how-to-make-simple-talking-head-video/?couponCode=31776BBACDFE200DE668",
        "org_price": "$89.99",
        "desc_text": "Video Production. How to Make Simple Talking Head Video\nImagine yourself as the spokesperson/star of your own website and social media forums. You can become your own best spokesperson. You can now stand out from all of your competitors who are still stuck in the text-only, pre-video era.\nThis Video Production course will teach you exactly how to make talking head videos that you can be proud of. The biggest problem most people have in making simple talking head videos is not the technology. The greatest challenge is looking comfortable, confident and relaxed. This course will teach you exactly how to look your best and come across as confident.\nWhy risk even one more day of relying on boring, mundane text to sell your products, services or organization? Your website and social media platforms can come alive today with simple talking head videos starring you. \nSign up today for this Video Production course today. \nThere is a 100% Money-Back Guarantee for this Video Production course. And the instructor also provides an enhanced guarantee.\nThe trainer has produced more than 100 online courses on spoken communication and has produced more than 10,000 talking head videos himself.\nWhat will students achieve or be able to do after taking this Video Production course?\nProduce a simple, talking head video\nMake short corporate video messages\nFeel comfortable talking on camera\nWhat do Udemy students say about this Video Production course?\n“5 Stars! Excellent teacher. Master!” Shri\n“5 Stars! Really concise and as interactive as any online course will be. TJ is the reason in completed my first Keynote speech with confidence. Thanks.” Seanan O De\nHere is what Udemy students say about this course:\n” really concise and as interactive as any online course will be. TJ is the reason in completed my first Keynote speech with confidence. Thanks” Seanan O De",
        "category": "Business",
        "language": "English",
        "platform": "Udemy",
        "rating": 4.75,
        "duration": 3,
        "expiry": "2025-07-07T12:26:15.885Z",
        "savedtime": "2025-07-02T12:26:15.885Z"
    },
    {
        "id": "19337",
        "sku": "21571",
        "pic": "https://img-c.udemycdn.com/course/750x422/338480_8d28_4.jpg",
        "title": "Public Speaking: C-Level Executive Public Speaking Skills",
        "coupon": "https://www.udemy.com/course/public-speaking-for-c-level-executives/?couponCode=DF02790BAD3DC5AEB56E",
        "org_price": "$84.99",
        "desc_text": "Public Speaking for C-Level Executives\nImagine yourself speaking like a supremely confident and accomplished CEO of a Fortune 500 corporation. You can speak with great authority and confidence right away.\nSolid public speaking skills are no longer an extra or a luxury for C-level executives; communication skills are a basic requirement for such jobs. You can get ready, now, for your promotion into the C-suite.\nIn this Public Speaking for C-Level executives course, you will learn how to present your ideas in front of employees, investors, the board of directors and colleagues in your industry. This course is about how to be a great public speaker, not merely an adequate one. You will learn how to reduce your time in speech preparation but generate far better results. And you will learn how to avoid the public speaking traps that label most executives as mid-level leaders who are not ready for Prime Time. This course will cover all essential aspects of public speaking, presentation skills and PowerPoint Presentations.\nWhy risk even one more day having the public speaking skills of a junior executive or mid-level manager? Sign up for this course today.\nWhat will students achieve or be able to do after taking this Public Speaking course?\nSpeak with authority\nPresent effectively to the board of directors, investors and employees\nDeliver PowerPoint in an engaging manner\nThere is a 100% Money-Back Guarantee for this  Public Speaking course. And the instructor also provides an enhanced guarantee.\nHere is what Udemy students say about this course:\n“TJ lays it out. He tells you what you have to do and he calls you out on just watching the videos and expecting to learn from them! Bravo! I really like the tasks/assignments. It got me started and that is what I needed, evidently!”  Teresa Trimm\n”Very logical, practical information that I knew but I needed to hear it from you, a professional, so my negative thoughts will stop getting in the way of my success. Thank you.” Angela Smucker\nThis Public Speaking course is ideal for anyone searching for more info on the following: public speaking – presentation – speaking – public speaking for beginners – kids – first steps into public speaking – debate – first step into public speaking – speech. Plus, this course will be a great addition to anyone trying to build out their knowledge in the following areas: presentation skills – communication skills – storytelling.",
        "category": "Business",
        "language": "English",
        "platform": "Udemy",
        "rating": 4.1,
        "duration": 2.5,
        "expiry": "2025-07-07T12:26:15.885Z",
        "savedtime": "2025-07-02T12:26:15.885Z"
    },
    {
        "id": "19338",
        "sku": "1284",
        "pic": "https://img-c.udemycdn.com/course/750x422/338792_a7e4_3.jpg",
        "title": "Personal Presentation Training",
        "coupon": "https://www.udemy.com/course/personal-presentation-training/?couponCode=6271C0730027109B15CD",
        "org_price": "$199.99",
        "desc_text": "Personal Presentation Training \n In this “Personal Presentation Training” course you will receive personalized training, feedback and coaching from TJ Walker, a leading public speaking coach to CEOs, Presidents of countries and Prime Ministers. You will receive up to 10 personalized video critiques of your speeches and you will receive a live Skype video session. This is a chance to get expert coaching from one of the true masters of public speaking, presentation and PowerPoint skills. This course is the next best thing to an in-person training workshop, only it is much less expensive. \nHere is what Udemy students say about this course:\n“He tells you how to do it. He is obviously experienced. And then after he educates you, he calls you out about not practicing…just watching isn’t going to fix a thing. Thanks, TJ”  Teresa Trimm\n***\n”Nice Course. Good information have include this course. I really like it.” Md. Israfil Hasan Prince\n***\n”it was a good match”  Ferdouse Abdelhameed\n***\n”It was a very good experience.”  Sanjana Pardeshi\n***\n”This sounds great, exactly what I was looking for.” MindFull Creations\n***\n“He tells you how to do it. He is obviously experienced. And then after he educates you, he calls you out about not practicing…just watching isn’t going to fix a thing. Thanks, TJ”  Teresa Trimm",
        "category": "Uncategorized",
        "language": "English",
        "platform": "Udemy",
        "rating": 4.5,
        "duration": 1.5,
        "expiry": "2025-07-07T12:26:15.885Z",
        "savedtime": "2025-07-02T12:26:15.885Z"
    },
    {
        "id": "19339",
        "sku": "3574",
        "pic": "https://img-c.udemycdn.com/course/750x422/2354532_1cdb_2.jpg",
        "title": "Learn Apache Spark to Generate Weblog Reports for Websites",
        "coupon": "https://www.udemy.com/course/ecommerce-weblog-report-generation-project-in-apache-spark/?couponCode=1CB5C2B2A4BE78204C98",
        "org_price": "$19.99",
        "desc_text": "Apache Spark is a flexible and fast framework designed for managing huge volumes of data. The engine supports the use of multiple programming languages, including Python, Scala, Java, and R. Therefore, before starting to learn Apache Spark use, you might want to focus on one of these languages.\nIn this Apache Spark tutorial, we will be focusing on the eCommerce weblog report generation. For companies that are highly dependent on their web presence and popularity, it is crucial to determine the factors that might be related to a successful eCommerce strategy. As a result, some business-owners consider analyzing weblogs. During Apache Spark training, you will be introduced with a variety of reports that you can generate from these weblogs.\nWhat is Apache Spark?\nTo learn Apache Spark, you need to be introduced to the basic principles of this engine. First of all, it is a framework for improving speed, simplicity of use, and streaming analytics spread by Apache. Apache Spark is an extremely efficient tool for performing data processing analysis.\nWhat are weblogs?\nA weblog can provide you with insightful information about how your visitors act on your website. By definition, weblog records the actions of users. They might be useful when aiming to determine which parts of your website attract the most attention. Logs can reveal how people found your website (for instance, search engines) and which keywords they used for searches.\nWhat will you find in this course?\nIn this course for people that have chosen to learn Apache Spark, we will be focusing on a practical project to improve your skills. There will be some basics of how to use Spark, but you are expected to have a decent understanding of the way it works.\nFor our project, you will have to download several files: they are a must for this Spark tutorial. Then, we will start by exploring file-level details and the process of creating a free account in DataBricks.\nThe aim of the project in this course to learn Apache Spark is to review all of the possible reports that you can conduct from the weblogs. We will be retrieving critical information from the log files. For this purpose, we will use the DataBricks Notebook. As a brief reminder: DataBricks allows you to write Spark queries instantly without having to focus on data problems. It is considered as one of the programs to help you manage and organize data.\nWe will learn how to use Spark to generate various types of reports. For instance, a session report provides information about the session activity, referring to the actions that a user with a unique IP performs during a specified period. The number of user sessions determines the amount of traffic that websites receive.\nThis Apache Spark training course will also focus on a pageview report, which determines how many pages were viewed during a specified time. Additionally, you will learn about a new visitor report, indicating the number of new users that have visited the website during a given time.\nTo learn Apache Spark better, you will be introduced with referring domains report, target domains report, top IP addresses report, search query report, and more!\nIn this course, you will learn to create Weblog Report Generation for Ecommerce website log in Apache Spark using Databricks Notebook (Community edition),\n1) Basics flow of data in Apache Spark, loading data, and working with data, this course shows you how Apache Spark is perfect for Big Data Reporting Engine.\n2) Learn the basics of Databricks notebook by enrolling into Free Community Edition Server\n3) Ecommerce Weblog Tracking Report generation Project real-world example.\n4) Graphical  Representation of Data using Databricks notebook.\n5) Create a Data Pipeline\n6) Launching Spark Cluster\n7) Process that data using Apache Spark\n8) Publish the Project on Web to Impress your recruiter\nAbout Databricks:\nDatabricks lets you start writing Spark queries instantly so you can focus on your data problems.\nLet’s discover more about the Ecommerce Weblog Tracking Report generation Project using Apache Spark\nData:\nThe data is Weblog or Website log of Ecommerce Server (Unreal Data for Training Purpose)",
        "category": "Business",
        "language": "English",
        "platform": "Udemy",
        "rating": 3.55,
        "duration": 1,
        "expiry": "2025-07-07T12:26:15.885Z",
        "savedtime": "2025-07-02T12:26:15.885Z"
    },
    {
    "id": "19400",
    "sku": "10123",
    "pic": "https://img-c.udemycdn.com/course/750x422/1565838_e54e_16.jpg",
    "title": "JavaScript Essentials 2024",
    "coupon": "https://www.udemy.com/course/javascript-essentials/",
    "org_price": "$89.99",
    "desc_text": "Aprende JavaScript desde cero: variables, funciones, DOM, eventos y más. Ideal para principiantes que quieren dominar el lenguaje del navegador.",
    "category": "Development, Web Development",
    "language": "English",
    "platform": "Udemy",
    "rating": 4.6,
    "duration": 8,
    "expiry": "2025-08-01T00:00:00.000Z",
    "savedtime": "2025-07-02T00:00:00.000Z"
  },
  {
    "id": "19402",
    "sku": "10125",
    "pic": "https://img-c.udemycdn.com/course/750x422/2776760_f176_3.jpg",
    "title": "Node.js for Beginners",
    "coupon": "https://www.udemy.com/course/nodejs-for-beginners/",
    "org_price": "$74.99",
    "desc_text": "Aprende los fundamentos de Node.js y Express para desarrollar aplicaciones backend modernas.",
    "category": "IT & Software, Backend Development",
    "language": "English",
    "platform": "Udemy",
    "rating": 4.5,
    "duration": 5,
    "expiry": "2025-09-01T00:00:00.000Z",
    "savedtime": "2025-07-02T00:00:00.000Z"
  },
  {
    "id": "19403",
    "sku": "10126",
    "pic": "https://img-c.udemycdn.com/course/750x422/1906852_93c6_2.jpg",
    "title": "Git y GitHub desde Cero",
    "coupon": "https://www.udemy.com/course/git-github-desde-cero/",
    "org_price": "$39.99",
    "desc_text": "Domina Git y GitHub con ejemplos prácticos. Aprende a versionar tus proyectos y colaborar en equipo.",
    "category": "IT & Software, Version Control",
    "language": "Spanish",
    "platform": "Udemy",
    "rating": 4.8,
    "duration": 3,
    "expiry": "2025-10-01T00:00:00.000Z",
    "savedtime": "2025-07-02T00:00:00.000Z"
  },
  {
    "id": "19407",
    "sku": "10130",
    "pic": "https://img-c.udemycdn.com/course/750x422/1565838_e54e_17.jpg",
    "title": "CSS Flexbox & Grid Masterclass",
    "coupon": "https://www.udemy.com/course/css-flexbox-grid/",
    "org_price": "$49.99",
    "desc_text": "Domina Flexbox y Grid con ejercicios prácticos. Creá layouts modernos y adaptables.",
    "category": "Development, Web Design",
    "language": "English",
    "platform": "Udemy",
    "rating": 4.5,
    "duration": 5,
    "expiry": "2025-12-01T00:00:00.000Z",
    "savedtime": "2025-07-02T00:00:00.000Z"
  },
  {
    "id": "19409",
    "sku": "10132",
    "pic": "https://img-c.udemycdn.com/course/750x422/851712_fc61_6.jpg",
    "title": "The Ultimate MySQL Bootcamp",
    "coupon": "https://www.udemy.com/course/the-ultimate-mysql-bootcamp-go-from-sql-beginner-to-expert/",
    "org_price": "$64.99",
    "desc_text": "Aprendé MySQL paso a paso con teoría, práctica y proyectos de base de datos reales.",
    "category": "IT & Software, Databases",
    "language": "English",
    "platform": "Udemy",
    "rating": 4.6,
    "duration": 9,
    "expiry": "2025-12-25T00:00:00.000Z",
    "savedtime": "2025-07-02T00:00:00.000Z"
  },
  {
    "id": "19411",
    "sku": "10134",
    "pic": "https://img-c.udemycdn.com/course/750x422/2196488_8fc7_10.jpg",
    "title": "Figma for Developers",
    "coupon": "https://www.udemy.com/course/figma-developers-ui/",
    "org_price": "$54.99",
    "desc_text": "Usá Figma como un pro: diseño de interfaces, prototipos interactivos y handoff para desarrolladores.",
    "category": "Design, UI/UX",
    "language": "English",
    "platform": "Udemy",
    "rating": 4.4,
    "duration": 3,
    "expiry": "2026-01-10T00:00:00.000Z",
    "savedtime": "2025-07-02T00:00:00.000Z"
  },
  {
    "id": "19412",
    "sku": "10135",
    "pic": "https://img-c.udemycdn.com/course/750x422/567828_67d0.jpg",
    "title": "Linux Command Line Basics",
    "coupon": "https://www.udemy.com/course/linux-command-line/",
    "org_price": "$34.99",
    "desc_text": "Aprendé a manejar Linux desde la terminal: comandos, navegación, permisos y scripts.",
    "category": "IT & Software, Operating Systems",
    "language": "English",
    "platform": "Udemy",
    "rating": 4.6,
    "duration": 2,
    "expiry": "2026-01-20T00:00:00.000Z",
    "savedtime": "2025-07-02T00:00:00.000Z"
  },
  {
    "id": "19415",
    "sku": "10138",
    "pic": "https://img-c.udemycdn.com/course/750x422/394676_ce3d_5.jpg",
    "title": "Web Design for Beginners: Real World Coding",
    "coupon": "https://www.udemy.com/course/web-design-for-beginners-real-world-coding-in-html-css/",
    "org_price": "$69.99",
    "desc_text": "Aprendé HTML, CSS y diseño responsive desde cero con proyectos reales.",
    "category": "Development, Web Design",
    "language": "English",
    "platform": "Udemy",
    "rating": 4.7,
    "duration": 11,
    "expiry": "2026-02-20T00:00:00.000Z",
    "savedtime": "2025-07-02T00:00:00.000Z"
  },
  {
    "id": "19416",
    "sku": "10139",
    "pic": "https://img-c.udemycdn.com/course/750x422/567828_67d0.jpg",
    "title": "Linux for Beginners",
    "coupon": "https://www.udemy.com/course/linux-for-beginners/",
    "org_price": "$59.99",
    "desc_text": "Curso ideal para empezar con Linux desde cero, sin experiencia previa.",
    "category": "IT & Software, Operating Systems",
    "language": "English",
    "platform": "Udemy",
    "rating": 4.5,
    "duration": 6,
    "expiry": "2026-03-01T00:00:00.000Z",
    "savedtime": "2025-07-02T00:00:00.000Z"
  },
  {
    "id": "19417",
    "sku": "10140",
    "pic": "https://img-c.udemycdn.com/course/750x422/625204_436a_2.jpg",
    "title": "Bootstrap 5 From Scratch",
    "coupon": "https://www.udemy.com/course/bootstrap-5-from-scratch/",
    "org_price": "$44.99",
    "desc_text": "Aprendé a crear sitios web responsivos y modernos con Bootstrap 5.",
    "category": "Development, Web Development",
    "language": "English",
    "platform": "Udemy",
    "rating": 4.6,
    "duration": 4,
    "expiry": "2026-03-05T00:00:00.000Z",
    "savedtime": "2025-07-02T00:00:00.000Z"
  },
  {
    "id": "19418",
    "sku": "10141",
    "pic": "https://img-c.udemycdn.com/course/750x422/851712_fc61_6.jpg",
    "title": "MySQL Bootcamp: SQL Beginner to Expert",
    "coupon": "https://www.udemy.com/course/the-ultimate-mysql-bootcamp-go-from-sql-beginner-to-expert/",
    "org_price": "$84.99",
    "desc_text": "El curso más completo para dominar MySQL desde cero.",
    "category": "IT & Software, Databases",
    "language": "English",
    "platform": "Udemy",
    "rating": 4.7,
    "duration": 9,
    "expiry": "2026-03-10T00:00:00.000Z",
    "savedtime": "2025-07-02T00:00:00.000Z"
  },
  {
    "id": "19420",
    "sku": "10143",
    "pic": "https://img-c.udemycdn.com/course/750x422/394676_ce3d_5.jpg",
    "title": "HTML & CSS: Curso Completo",
    "coupon": "https://www.udemy.com/course/html-css-completo/",
    "org_price": "$69.99",
    "desc_text": "Aprendé las bases del desarrollo web frontend con HTML y CSS.",
    "category": "Development, Web Development",
    "language": "Spanish",
    "platform": "Udemy",
    "rating": 4.4,
    "duration": 5,
    "expiry": "2026-03-25T00:00:00.000Z",
    "savedtime": "2025-07-02T00:00:00.000Z"
  },
  {
    "id": "19423",
    "sku": "10146",
    "pic": "https://img-c.udemycdn.com/course/750x422/1463348_52a4_2.jpg",
    "title": "Vue JS Essentials",
    "coupon": "https://www.udemy.com/course/vue-js-course/",
    "org_price": "$74.99",
    "desc_text": "Curso moderno de Vue 3 para crear SPA con composition API.",
    "category": "Development, Frontend Frameworks",
    "language": "English",
    "platform": "Udemy",
    "rating": 4.5,
    "duration": 7,
    "expiry": "2026-04-10T00:00:00.000Z",
    "savedtime": "2025-07-02T00:00:00.000Z"
  },
  {
    "id": "19424",
    "sku": "10147",
    "pic": "https://img-c.udemycdn.com/course/750x422/2634490_e343_3.jpg",
    "title": "MongoDB - The Complete Developer Guide",
    "coupon": "https://www.udemy.com/course/mongodb-the-complete-developers-guide/",
    "org_price": "$89.99",
    "desc_text": "Base de datos NoSQL completa desde cero: MongoDB, Mongoose y más.",
    "category": "IT & Software, Databases",
    "language": "English",
    "platform": "Udemy",
    "rating": 4.7,
    "duration": 12,
    "expiry": "2026-04-15T00:00:00.000Z",
    "savedtime": "2025-07-02T00:00:00.000Z"
  }
]